# RebarBarDeformationType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarBarDeformationType Property
ParameterTypeId Class See Also
---
"Deformation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarBarDeformationType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarBarDeformationType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarBarDeformationType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace